app/controllers/cryptocurrencys_controller.rb

  def fetch
    cryptocurrency = Cryptocurrency.find_by name: 'btc'
    if cryptocurrency.name == "btc"
      response = Faraday.get "https://api.coinmarketcap.com/v1/ticker/bitcoin/"
      response = JSON.parse(response.body)[0]
      @name = "Bitcoin"
    else
      response = Faraday.get "https://api.coinmarketcap.com/v1/ticker/ethereum/"
      response = JSON.parse(response.body)[0]
      @name = "Ethereum"
    end
    @price = response["price_usd"].to_f
    @marketcap = response["market_cap_usd"].to_f
    @volume = response["24h_volume_usd"].to_f
    cryptocurrency.update(marketcap: @marketcap, price: @price, volume: @volume)
---
SELECT  "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."name" = ? LIMIT ?  [["name", "btc"], ["LIMIT", 1]]
UPDATE "cryptocurrencies" SET "marketcap" = ?, "price" = ?, "volume" = ?, "updated_at" = ? WHERE "cryptocurrencies"."id" = ?  [["marketcap", 111929571352.0], ["price", 6711.1], ["volume", 6178440000.0], ["updated_at", "2017-11-14 01:09:38.532353"], ["id", 1]]