app/controllers/cryptocurrencys_controller.rb

SELECT  "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def fetch
    cryptocurrency = Cryptocurrency.find_by_id(params[:id])